# Ввести з клавіатури 4 рядки та зберегти їх у 4 різні змінні.
# Створити файл і записати в нього перші 2 рядки та закрити файл.
# Потім відкрити файл на редагування і дозаписати 2 рядки, що залишилися.
# У підсумку файл має бути 4 рядки, кожен з яких повинен починатися з нового рядка.

line_1 = input("Введіть перший рядок: ")
line_2 = input("Введіть другий рядок: ")
line_3 = input("Введіть третій рядок: ")
line_4 = input("Введіть четвертий рядок: ")

with open('hw_02.txt', 'w') as f:
    f.writelines([line_1 + '\n', line_2])

with open('hw_02.txt', 'a') as f:
    f.write('\n' + line_3 + '\n' + line_4)
