# Создать 2 класса truck и car, которые являются наследниками класса auto из
# предыдущего домашнего задания. Объекты класса truck имеют дополнительный
# обязательный атрибут max_load.
# Переопределённый метод move, перед появлением надписи «move» выводит
# надпись «attention», его реализацию сделать при помощи оператора super.
# А так же дополнительный метод load. При его вызове происходит пауза 1 сек.,
# затем выдаётся сообщение «load» и снова пауза 1 сек.
# Объекты класса car имеют дополнительный обязательный атрибут max_speed и при
# вызове метода move, после появления надписи «move» должна появиться надпись
# «max speed is <max_speed>». Вместо <max_speed> должно выводится значение
# обязательного атрибума max_speed. Создать по 2 объекта для каждого из классов
# truck и car, проверить все их методы и атрибуты.
