# 1. Створити 2 змінні з однаковими даними (і однаковим типом) та з
# однаковими ідентифікаторами (не присвоюючи значення змінних один одному)
#
# a_1 = ...
# a_2 = ...
#
# a1 == a2
# True
#
# a1 is a2
# True
#
# 2. Створити 2 змінні з однаковими даними (і однаковим типом) та з
# різними ідентифікаторами (результат функції id())
#
# b_1 = ...
# b_2 = ...
#
# b_1 == b_2
# True
#
# b_1 is b_2
# False
#
# Замість «...» необхідно вставити якісь данні, при цьому у першому завданні
# обоїм змінним треба присвоєти однакові данні, та в другому завданні інші,
# але теж однако ві дані.
#
# 3. *Додаткове необов'язкове завдання:
# Поміняти їх типи так, щоб у 1-х двох змінних стали різні ідентифікатори,
# але при цьому залишилися однакові дані (і однаковим типом), а у 2-х останніх
# стали однакові ідентифікатори та залишилися однакові дані.
#
# Досягти потрібного результату необхідно лише приведенням типів даних до потрібного.
#
# a_1 = type_1(a_1)
# a_2 = type_1(a_2)
#
# a1 == a2
# True
#
# a1 is a2
# False
#
#
# b_1 = type_2(b_1)
# b_2 = type_2(b_2)
#
# b1 == b2
# True
#
# b1 is b2
# True
#
#
# type_1 – один тип даних
# type_2 – інший тип даних


a1 = "text"
a2 = "text"

print('a1:', a1, ' type:', str(type(a1)), ' id:', str(id(a1)))
print('a2:', a2, ' type:', str(type(a2)), ' id:', str(id(a2)))

print('*' * 50)

a1 = list(a1)
a2 = list(a2)
print('a1:', a1, ' type:', str(type(a1)), ' id:', str(id(a1)))
print('a2:', a2, ' type:', str(type(a2)), ' id:', str(id(a2)))

print('*' * 50)

b1 = ['test', 1, 5]
b2 = ['test', 1, 5]
print('b1:', b1, ' type:', str(type(b1)), ' id:', str(id(b1)))
print('b2:', b2, ' type:', str(type(b2)), ' id:', str(id(b2)))

print('*' * 50)
b1 = bool(b1)
b2 = bool(b2)
print('b1:', b1, ' type:', str(type(b1)), ' id:', str(id(b1)))
print('b2:', b2, ' type:', str(type(b2)), ' id:', str(id(b2)))
