# 1. Создать 3 переменные с одинаковыми данными (и одинаковым типом) и с
# одинаковыми идентификаторами (не присваивая значения переменных друг другу)
# 2. Создать 2 переменные с одинаковыми данными (и одинаковым типом) и с
# разными идентификаторами
# 3. Поменять их типы так, чтобы у 1-х трёх стали разные идентификаторы, но
# при этом остались одинаковые данные (и одинаковым типом), а у 2-х последних
# стали одинаковые идентификаторы и остались одинаковые данные.
#
# * добиться нужного результата необходимо только приведением типов данных к нужному
#
# Пример выполнения:
# a1 = ....
# a2 = ....
# a1 == a2
# True
#
# a1 is a2
# True
#
# преобразование типов а1 и а2 без присвоения им новых значений
