# Дан список чисел. Посчитать сколько раз встречается каждое число.
# Использовать для подсчёта функцию.
# Подсказка: для хранения данных использовать словарь (ключ - само число,
# а значение - сколько раз оно встречается). Для проверки нахождения
# элемента в словаре использовать метод get(), либо оператор in.

# *Дополнительные не обязательные условия:
#  - первоначальный список размером в 200 элементов формируется из чисел
#    от 1 до 10 включительно взятых случайным образом;
#  - сформировать итоговый словарь (где ключ это само число, а значение это
#    кол-во повторений данного числа в первоначальном списке) с помощью
#    конструкции "генератор словарей";
#  - итоговый вывод отсортировать по порядку возрастания числа, к примеру:
#      Число 1 встречается в первоначальном списке 10 раз
#      Число 2 встречается в первоначальном списке 3 раза
#      Число 3 встречается в первоначальном списке 14 раз
#      Число 4 встречается в первоначальном списке 22 раза
#      и т.д.
#  - использовать лямбда-функцию для того, что определить какое слово надо
#    написать для конкретного числа: "раз" или "раза"
