# Ваша програма повинна вміти розділяти один список на два та помістити їх у
# новий список. Тобто, в результаті повинен вийти список із 2-х списків.
# Якщо в початковому списку непарна кількість елементів, то в першому списку
# має бути більше елементів. Якщо у списку немає елементів, то має бути
# створений список із двома порожніми списками. Важливо! Потрібно створити
# рішення, яке обробляє 3 випадки - список порожній, у списку парна кількість
# елементів і в списку непарна кількість елементів.
#
# Приклади:
# Було => стало
# [1, 2, 3, 4, 5, 6] => [[1, 2, 3], [4, 5, 6]]
# [1, 2, 3] => [[1, 2], [3]]
# [1, 2, 3, 4, 5] => [[1, 2, 3], [4, 5]]
# [1] => [[1], []]
# [] => [[], []]

# Для перевірки коректності роботи Вашого коду використовуйте приклади вище.
# Робити запит на введення даних від користувача не потрібно.


def func(elements):
    midpoint = (len(elements) + 1) // 2

    first_half = elements[:midpoint]
    second_half = elements[midpoint:]

    print([first_half, second_half])


func([1, 2, 3, 4, 5, 6])
func([1, 2, 3])
func([1, 2, 3, 4, 5])
func([1])
func([])
func([1, 2, 3, 4, 5, 6, 7])
