# Напишіть програму, яка запитує у користувача його ім'я, вік та місце 
# проживання, а потім виводить їх у наступному форматі:
# "Привіт, мене звуть {0}. Мені {1} років. Я живу в {2}."
#
# Замість {0}, {1} та {2} підставте відповідні значення. Використовуйте метод
# format() для форматування рядка. Потім спробуйте використати f-рядок.
# Виведіть результат на екран за допомогою команди print.
#
# Приклад :
# Введіть ваше ім'я: Alice
# Введіть ваш вік: 25
# Введіть місце проживання: London
#
# Привіт, мене звуть Alice. Мені 25 років. Я живу у London.



