# Запросити у користувача число. Якщо введено не ціле число, видати на екран
# повідомлення: "не вірне введення".
# Якщо введено число, то за допомогою тернарного виразу обчислити яке число
# введено – парне чи непарне. (Умова перевірки на парність: х % 2)
# Після цього вивести на екран: "Ви ввели парне число" або "Ви ввели непарне
# число". При цьому вивід необхідно організувати у вигляді шаблону, у який
# залежно від введення підставляється слово "парне" або "непарне".
#
# *Додаткове необов'язкове завдання: тернарний вираз вміє крім визначення
# парне/непарне так само визначати нуль.


digit_user = input("Введить ціле число: ")
if digit_user and (digit_user.isdigit() or (digit_user[0] == '-' and digit_user[1:].isdigit())):
    digit_user = int(digit_user)
    result = "0" if digit_user == 0 else "even" if digit_user % 2 == 0 else "odd"
    print(f'digit_user is {result}')
else:
    print("не вірне введення")
