# Ваше завдання — написати програму, яка перемножує всі цифри, введені
# користувачем цілого числа, поки воно не стане менше або дорівнювати 9.
# Користувач вводить число з клавіатури.
#
# Приклади:
# 999 -> 2 # Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729, Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
# 1000 -> 0
# 423 -> 8
# 33 -> 9
# 25 -> 0
# 1 -> 1

def check(my_variable):
    num = int(my_variable)
    while num > 9:
        result = 1
        for i in str(num):
            result = result * int(i)
        num = result
    print(num)


check("999")
check("1000")
check("423")
check("33")
check("25")
check("1")
