# Ваше завдання — написати програму, яка перемножує всі цифри, введені
# користувачем цілого числа, поки воно не стане менше або дорівнювати 9.
# Користувач вводить число з клавіатури.
#
# Приклади:
# 999 -> 2 # Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729, Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
# 1000 -> 0
# 423 -> 8
# 33 -> 9
# 25 -> 0
# 1 -> 1


def func(numb):
    numb = str(numb)
    result = 1
    for char in numb:
        result *= int(char)

    while result > 9:
        temp = str(result)
        result = 1
        for char in temp:
            result *= int(char)

    print(result)


func(999)
func(1000)
func(423)
func(33)
func(25)
func(1)
