# Ваше завдання — написати програму, яка переводить число у формат часу у
# читальному вигляді. Користувач повинен ввести число більше або дорівнює 0 і
# менше ніж 8640000. Число, яке є кількістю секунд, необхідно перевести в дні,
# години, хвилини та секунди. Ну і додатковим завданням є турбота про виведення.
#
# Слово "день" підбирається на основі кількості днів, а години, хвилини і
# секунди повинні заповнюватися нулями при одноцифрових значеннях.
# Підказка: одна хвилина - 60 сек. , В одній годині 60 * 60 сек, в одній добі
# 24 * 60 * 60 сек. Тобто використовуючи функцію divmod або методи поділу
# // і % вам необхідно знайти відповідну кількість днів, годин, хвилин, а те
# що залишиться - це секунди, які менше 60 ;)
# Доповнити провідними нулями можна за допомогою методу zfill(2)
#
# Приклад:
# 0 -> 0 днів, 00:00:00
# 224930 -> 2 дні, 14:28:50
# 466289 -> 5 днів, 09:31:29
# 950400 -> 11 днів, 00:00:00
# 1209600 -> 14 днів, 00:00:00
# 1900800 - > 22 дні, 00:00:00
# 8639999 -> 99 днів, 23:59:59
# 22493 -> 0 днів, 06:14:53
# 7948799 -> 91 день, 23:59:59

def check(seconds):
    number = int(seconds)

    if number < 0 or number >= 8640000:
        print("Error")
    else:
        days, remainder = divmod(number, 24 * 60 * 60)
        hours, remainder = divmod(remainder, 60 * 60)
        minutes, seconds = divmod(remainder, 60)

        if days % 10 == 1 and days % 100 != 11:
            day_word = "день"
        elif days % 10 in (2, 3, 4) and days % 100 not in (12, 13, 14):
            day_word = "дні"
        else:
            day_word = "днів"

        number_time = f"{str(hours)}:{str(minutes)}:{str(seconds)}"

        print(f"{days} {day_word}, {number_time}")


check("0")
check("224930")
check("466289")
check("950400")
check("1209600")
check("1900800")
check("8639999")
check("22493")
check("7948799")
