# Прочитати збережений json-файл з попереднього завдання та записати дані на
# диск у csv-файл, першим стовпчиком буде ID (6-ти значне число, котре у
# попередньому завданні було ключем) і додавши новий стовпець "телефон".
# Крім цього, необхідно для кожного запису додати значення нового осередку
# “телефон”. Значення має бути заповнене випадковими цифрами.
# Назви стовпців будуть наступні:
# ID, Ім'я, Вік, Телефон.
# При цьому значення для перших трьох осередків необхідно дістати з json-файлу
# для кожного запису, а значення нового осередку "Телефон" сформувати.
#
# *Додаткове завдання не обов'язкове до виконання:
# формування значення комірки телефону має бути наступним:
# • не всі люди можуть мати номер телефону. Хто має номер телефону,
# а хто ні визначається автоматично випадковим чином.
# З ймовірністю 75% осіб має номер телефону, з ймовірністю 25% - ні;
# • є список можливих трьох перших цифр (операторів),
# Наприклад: ['095', '066', '098', '096', '050', '097']
# • при формуванні нового номера телефону перші 3 цифри вибираються випадковим
# чином зі списку можливих операторів, решта 7 цифр може бути будь-якими
# і формуються випадковим чином.
# Для виконання цього завдання необхідно розібратися з бібліотекою "random"
