# Прочитати збережений csv-файл із попереднього завдання та зберегти дані
# в excel-файл. Крім віку - стовпець з цими даними не потрібний.
# *Додаткове завдання не обов'язкове до виконання:
# розгорнути таблицю на дев'яносто градусів (стовпці стають рядками,
# а рядки стовпцями). До завдання прикріплений приклад як має виглядати
# змісту підсумкового файлу.
# Прочитати збережений csv-файл із попереднього завдання та зберегти дані
# в excel-файл. Крім віку - стовпець з цими даними не потрібний.

