# Даний словник
# Створити новий словник, ключами якого буде результат конкатенації ключа
# старого словника та довжини цього ключа, а значенням буде квадрат
# початкового значення, якщо початкове значення типу int, інакше значенням
# буде довжина початкового значення

old_dict = {'aa': 1, 'b': 2, 'cccc': 3, 'ddd': '111'}
new_dict = {'aa2': 1, 'b1': 4, 'cccc4': 9, 'ddd3': 3}

new_dict_2 = {key + str(len(key)): value ** 2 if type(value) == int else len(value) for key, value in old_dict.items()}

print(new_dict_2)
