# Создать список из двух элементов.
# Создать кортеж из двух элементов.
# Создать словарь с одной парой. Ключ - кортеж, значение – список
# Создать словарь с одной парой. Ключ - список, значение – кортеж

a = (1, 2)
b = [1, 2]

d_1 = {a: b}
print(d_1)

d_2 = {b: a}
print(d_2)
