# Напишіть програму, яка запитує у користувача два логічні значення (True або
# False) і виводить результати наступних логічних операцій:

# Логічне І (and) між двома значеннями.
# Логічне АБО (or) між двома значеннями.
# Логічне НЕ (not) кожного значення.
# Результат порівняння двох значень на рівність.
# Результат порівняння двох значень на нерівність.

# Результати мають бути виведені за допомогою print. Введену строку "True"
# або "False" треба привести до булевого типу "True" або "False" і потім вже
# над булевими значеннями проводити операції.
