# Напишіть програму, яка запитує у користувача два логічні значення (True або
# False) і виводить результати наступних логічних операцій:

# Логічне І (and) між двома значеннями.
# Логічне АБО (or) між двома значеннями.
# Логічне НЕ (not) кожного значення.
# Результат порівняння двох значень на рівність.
# Результат порівняння двох значень на нерівність.

# Результати мають бути виведені за допомогою print. Введену строку "True"
# або "False" треба привести до булевого типу "True" або "False" і потім вже
# над булевими значеннями проводити операції.


a = input("Введите значение a (True или False):")
b = input("Введите значение b (True или False):")
a = True if a.lower() == "true" else False
b = True if b.lower() == "true" else False

print("a and b =", a and b)
print("a or b =", a or b)
print("not a =", not a)
print("not b =", not b)
print("a == b =", a == b)
print("a != b =", a != b)
