# Напишіть програму, яка запитує у користувача ціле позитивне число і перевіряє, 
# чи є воно простим. Просте число - це число, яке ділиться тільки на 1 і на само 
# себе без залишку. Використовуйте цикл і перевірку поділу числа на всі числа 
# від 2 до N-1 для вирішення задачі.
# Виведіть відповідне повідомлення на екран за допомогою print.
#
# Приклад:
# Введіть позитивне число: 17
# Число 17 є простим.


number = int(input('Введіть ціле позитивне число:'))
count = 2
while count < number:
    if number % count == 0:
        print('Число', number, 'не є простим.')
        break
    count += 1

else:
    print('Число', number, 'є простим.')
