# Напишіть програму, яка запитує у користувача натуральне десяткове число і 
# виводить його двійкове уявлення. Реалізуйте алгоритм переведення числа в 
# двійкову систему числення, використовуючи основні концепції подання чисел 
# (підказка: через розподіл із залишком). Виведіть отримане подання числа на екран.
#
# Приклад:
# Введіть натуральне десяткове число: 123
# Двійкове уявлення числа: 1111011


number = int(input('Введіть натуральне десяткове число:'))
res = ''
while number > 0:
    res = str(number % 2) + res
    number //= 2
print('Двійкове уявлення числа:', res)
