# Напишіть програму, яка запитує у користувача ціле число і визначає, чи є 
# воно паліндромом. Число є паліндромом, якщо воно читається однаково зліва 
# направо і праворуч наліво. Виведіть відповідне повідомлення на екран за 
# допомогою команди print. Використовуйте математичні операції. 
# Роботу з рядками використовувати не можна.
#
# Приклад:
# Введіть ціле число: 12321
# Число є паліндромом.
# Введіть ціле число: 12323
# Число не є паліндромом.


N = int(input("Введіть ціле число:"))
saveN = N
reverseN = 0
while N > 0:
    reverseN *= 10
    reverseN += N % 10
    N //= 10
if saveN == reverseN:
    print("Число є паліндромом")
else:
    print("Число не є паліндромом")
