# Напишіть програму, яка запитує у користувача ціле число і перевіряє, чи 
# є воно числом Армстронга. Число Армстронга - це число, яке дорівнює сумі 
# своїх цифр, зведених у ступінь, що дорівнює кількості цифр у числі. 
# Виведіть відповідне повідомлення на екран за допомогою команди # print.
#
# Приклад:
# Введіть ціле число: 153 (це без виводу на екран: 153 = 1**3 + 5**3 + 3**3)
# Число є числом Армстронга.


N = int(input("Введіть натуральне число:"))
saveN = N
digits = 0
while N > 0:
    N //= 10
    digits += 1
arm = 0
N = saveN
while N > 0:
    arm += (N % 10) ** digits
    N //= 10
if saveN == arm:
    print("Число є числом Армстронга")
else:
    print("Число не є числом Армстронга")
