# Напишіть програму, яка запитує у користувача рядок і вирівнює його по центру 
# із заданою шириною. Якщо рядок не може бути вирівняний по центру через 
# непарну ширину, він повинен бути вирівнен зсувом вправо.
# Використовуйте методи center() та rjust() для вирівнювання рядка.
#
# Приклад:
# Введіть рядок: Python
# Введіть ширину: 10
# Результат:
#   Python
# Введіть рядок: Python
# Введіть ширину: 5
# Результат: 
# Python
# Введіть рядок: Python
# Введіть ширину: 21
# Результат:
#        Python
