# Напишіть програму, яка приймає список слов і повертає список якій містить тільки 
# анаграми. Анаграми - це слова, складені з тих самих букв, але у різному 
# порядку. Створіть функцію anagrams, яка приймає список слів як аргумент
# та повертає список анаграм. Використовуйте безліч і сортування букв у слові
# для перевірки на анаграму. Виведіть результат на екран.
#
# Приклад переданого списку слів:
# ['cat', 'dog', 'tac', 'god', 'act']
#
# Приклад висновку:
# Анаграми: ['dog', 'god'], ['cat', 'tac', 'act']


def anagrams(x):
    a = []
    for i in x:
        i = i.strip('[]"\',')
        for k in a:
            if sorted(k[0]) == sorted(i):
                k.append(i)
                break
        else:
            a.append([i])
    return a


s = input("Введите список: ").split()
print("Анаграми: ")
for k in anagrams(s):
    if len(k) > 1:
        print(k)
