# Напишіть програму, яка приймає список слов і повертає список якій містить тільки 
# анаграми. Анаграми - це слова, складені з тих самих букв, але у різному 
# порядку. Створіть функцію anagrams, яка приймає список слів як аргумент
# та повертає список анаграм. Використовуйте безліч і сортування букв у слові
# для перевірки на анаграму. Виведіть результат на екран.
#
# Приклад переданого списку слів:
# ['cat', 'dog', 'tac', 'god', 'act']
#
# Приклад висновку:
# Анаграми: ['dog', 'god'], ['cat', 'tac', 'act']
