# Створіть клас BankAccount для надання банківського рахунку. Клас повинен
# мати атрибути account_number (номер рахунку) та balance (баланс), а також
# методи deposit() для внесення грошей на рахунок і withdraw() для зняття 
# грошей з рахунку. Потім створіть екземпляр класу BankAccount, внесіть на 
# рахунок деяку суму і зніміть частину грошей. Виведіть баланс, що залишився. 
# Не забудьте передбачити варіант, при якому при знятті баланс може стати 
# меншим за нуль. У цьому випадку йти в мінус не будемо, замість чого 
# повертатимемо повідомлення "Недостатньо коштів на рахунку".
